//==========================================
//
//  建物(build.cpp)
//  Author : Tomoya Kanazaki
//
//==========================================
#include "build.h"

//==========================================
//  コンストラクタ
//==========================================
CBuild::CBuild(int nPriority) : CObject_Char(nPriority)
{

}

//==========================================
//  デストラクタ
//==========================================
CBuild::~CBuild()
{

}

//==========================================
//  初期化処理
//==========================================
HRESULT CBuild::Init(void)
{
	//タイプの設定
	SetType(TYPE_MAP);

	//階層構造情報を生成
	m_pLayer = CLayer::Set(CLayer::MAP_LAYER);

	return CObject_Char::Init();
}

//==========================================
//  終了処理
//==========================================
void CBuild::Uninit(void)
{
	CObject_Char::Uninit();
}

//==========================================
//  更新処理
//==========================================
void CBuild::Update(void)
{
	CObject_Char::Update();
}

//==========================================
//  描画処理
//==========================================
void CBuild::Draw(void)
{
	CObject_Char::Draw();
}

//==========================================
//  生成処理
//==========================================
CBuild* CBuild::Create(void)
{
	//変数宣言
	CBuild* pBuild = nullptr;

	//インスタンス生成
	pBuild = new CBuild;

	//初期化処理
	pBuild->Init();

	return pBuild;
}
